# Урок 1

```pascal
program MyProgram; // Название программы

begin // Начало программы
  writeln('***'); // writeln = write line = вывести текст и начать новую линию
  // аргумент - строка '***'
  // начало строки обозначается через первую кавычку
  // конец строки - через вторую
  // в конце строки нужно ставить точку с запятой (;)
  writeln('* *');
  writeln('***');
end. // Конец программы
```
## Задание:
Написать программу, которая должна написать "Привет, Мир!"

# Урок 2
## Переменные и типы данных

### Переменные
Что такое переменная?
*Переменная* - это как будто коробка, в которой хранится какое-то значение.
У каждой переменной есть:
1. Название. Например, `x` или `QWE`.
2. Тип это переменной. Например, `integer` или `string`.
3. Значение этой переменной (то есть, содержимое коробки). Например, `x` может равняться `5`.

Примечание: слово "значение" нужно воспринимать как "то, чему оно равняется", а не как "смысл".

Например, пусть есть переменная `x`, в которой хранится число 5.
Куда бы ты эту переменную не перемещал, в ней всё равно хранится пятёрка.

Когда ты объявляешь переменную, и не присваиваешь ей значение, в ней хранится начальное значение.
Для `integer` это `0`, для `string` это пустая строка, то есть, `''`.

### Типы данных
Тип данных - это такая характеристика (свойство) переменной или выражения, определяющая, какие значения может принимать данная переменная и какие операции с ней допустимы.

В PascalABC существуют следующие типы данных:
1. Числовые:
   1. `integer` - целые числа.
   2. `real` - целые и дробные числа.
   3. `double` - целые и дробные числа, но могут быть больших размеров.
2. Символные и строчные:
   1. `char` - символьный тип. Значения - символы, например, `f`, `7`, `=`, `?`.
   2. `string` - строчный тип. Значения - какие-то строки, например, `hello`, `Ноториус Биг`, `P.S.Y`.
3. `boolean` - логический тип. Значения - `true` (истина) или `false` (ложь).
4. Прочие типы: массивы, записи, классы. Пока не будем о них говорить

### Операторы
У каждого типа данных есть свои операторы.

Оператор - это действие, которое можно совершить над одной или несколькими переменными.

Над разными объектами (переменными) возможно совершать разные действия.
Например, числа можно суммировать, вычитать, делить, умножать.

Список операторов:
1. Присвоение значения. Присвоение - это когда мы объясняем программе, что хотим положить в переменную, какое значение. 
   - Пример: `x := 10` - в переменную `x` кладём значение `10`.
2. Сложение. Складываются два значения.
   - Пример 1: Пусть переменная `x` имеет значение `10`, переменная `y` имеет значение `5`.
      Тогда `x+y` равняется `15`
   - Пример 2: Пусть переменная `s1` имеет значение `йоу`, переменная `s2` имеет значение `привет`.
      Тогда `s1+s2` равняется `йоупривет`
3. Есть другие операторы. 

### Программы

Программа, в которой:
1. Объявляется переменная `x` типа `integer`
2. `x` вводится через `readln`
3. 
```pascal
program MyProgram; 

var // объявление переменных
  x:integer; // название_переменной:тип_переменной
begin // начало программы
  readln(x); // readln = real line = считать линию
  // Считывает с линии введённую строку
  writeln('Вы ввели:', x);
end. // конец программы
```
## Задание:
Написать программу, которая должна:
1. Считать два числа в две переменных
2. Посчитать их сумму и засунуть результат в третью переменную
3. Вывести третью переменную

# Урок 3
## Условия (if) и циклы (for, while)

### Условия
Условие - это часть программы, в котором мы говорим программе:
1. Если *какое-то условие* выполнено, то сделай *действие 1*
2. Если выполнено *какое-то другое условие*, то сделай *действие 2*
3. В противном случае, сделай *действие 3*

Пример из жизни:
1. Если *ты голодный*, *сходи поешь*
2. Если *получил двойку*, *начинай плакать*
3. Иначе, *радуйся*

Общая структура: 

### Калькулятор
```pascal
program MyProgram; 

var
  a , b:real;
  operation:char;
  answer:real;
begin
  writeln('введите первое число:');
  readln(a);
  writeln('введите операцию:');
  readln(operation);
  writeln('введите второе число:');
  readln(b);
  
  if operation = '+' 
    then answer := a + b
  else if operation = '-'
    then answer := a-b
  else if operation = '/'
    then answer := a/b
  else if operation = '*'
    then answer := a*b
  else writeln('Неверный оператор! Понял???!!!');
  
  writeln('ответ:', answer);
    
end.
```
## Задание:

### Циклы
Цикл - это часть программы, которая повторяется несколько раз (в том числе, может быть 0 раз) по какому-то заданному условию.

Пример: "выполни 10 раз какое-то действие" - это цикл со счётчиком или "приседай, пока не устанешь" - цикл, пока не выполнится какое-то условие

Цикл, описанный с помощью условия `for`
```
var 
  i: integer;
begin
  // Цикл, описанный с помощью for
  for i := 1 to 5 do // от i = 1 до i = 5 выполняй, то есть
    // Мы говорим компьютеру: 
    //  1. Пускай у тебя есть итератор (счётчик) с названием i
    //  2. Изначальное значение счётчика равно 1
    //  3. Увеличивай этот счётчик, пока он не станет равным 5
    //  4. Каждый раз, когда увеличиваешь счётчик, выполняй действие
    // Счётчик должен иметь тип integer.
    
    write(i, ' '); // выводит текст, но не переключает на следующую строку
  
  writeln;
end.
```
Если хочется выполнить несколько действий, нужно:
1. После `do` нужно поставить `begin`.
2. Перечислить действия, которые нужно выполнить
3. После действий написать `end;` (с точкой с запятой).

## Задание:
Программа должна:
1. Принимать на вход два целых числа - `a` и `b`.
2. Посчитать сумму всех чисел от `a` до `b`.
3. Вывести посчитанную сумму.

Цикл, описанный с помощью условия `while`.
```
var 
  i: integer;
begin
  i := 1;

  while i<=5 do // Пока условие выполняется, делай
  begin
    write(i,' ');
    i := i + 1;
  end;

  writeln;
end.
```

## Задание:
Программа должна:
1. Случайно сгенерировать число от 1 до 10.
2. Игрок должен вводить число. Если введённое число не равняется сгенерированному, то выводить "Хахаха", и игрок должен снова ввести число.
3. Если равняется, выводить "Молодец" и завершать работу программы.

Как работает генератор:
```
var 
  a: integer;
begin
    randomize; // Говорим программе, чтобы она при каждом новом запуске выдавала случайное число (а не одно и то же).
    a := random(10) + 1;  // Функция random(x) выдаёт случайное число от 0 до x-1
                          // Если не будем добавлять единицу, то числа будут выдаваться от 0 до 9, а нам нужно от 1 до 10
    writeln(a);
end.
```

```
var i: integer;
begin
// С помощью for
  for i := 1 to 5 do
    write(i,' ');
  writeln;
  
  for i := 5 downto 1 do
    write(i,' ');
  writeln;
  writeln;
  
// С помощью while
  i := 1;
  while i<=5 do
  begin
    write(i,' ');
    i := i + 1;
  end;
  writeln;
  
  i := 5;
  while i>=1 do
  begin
    write(i,' ');
    i := i - 1;
  end;
  writeln;
  writeln;

// С помощью repeat
  i := 1;
  repeat
    write(i,' ');
    i := i + 1;
  until i>5;
  writeln;

  i := 5;
  repeat
    write(i,' ');
    i := i - 1;
  until i<1;
  writeln;
end.
```



