# Урок 1

```pascal
program MyProgram; // Название программы

begin // Начало программы
  writeln('***'); // writeln = write line = вывести текст и начать новую линию
  // аргумент - строка '***'
  // начало строки обозначается через первую кавычку
  // конец строки - через вторую
  // в конце строки нужно ставить точку с запятой (;)
  writeln('* *');
  writeln('***');
end. // Конец программы
```
## Задание:
Написать программу, которая должна написать "Привет, Мир!"

# Урок 2
## Переменные и типы данных

### Переменные
Что такое переменная?
*Переменная* - это как будто коробка, в которой хранится какое-то значение.
У каждой переменной есть:
1. Название. Например, `x` или `QWE`.
2. Тип это переменной. Например, `integer` или `string`.
3. Значение этой переменной (то есть, содержимое коробки). Например, `x` может равняться `5`.

Примечание: слово "значение" нужно воспринимать как "то, чему оно равняется", а не как "смысл".

Например, пусть есть переменная `x`, в которой хранится число 5.
Куда бы ты эту переменную не перемещал, в ней всё равно хранится пятёрка.

Когда ты объявляешь переменную, и не присваиваешь ей значение, в ней хранится начальное значение.
Для `integer` это `0`, для `string` это пустая строка, то есть, `''`.

### Типы данных
Тип данных - это такая характеристика (свойство) переменной или выражения, определяющая, какие значения может принимать данная переменная и какие операции с ней допустимы.

В PascalABC существуют следующие типы данных:
1. Числовые:
   1. `integer` - целые числа.
   2. `real` - целые и дробные числа.
   3. `double` - целые и дробные числа, но могут быть больших размеров.
2. Символные и строчные:
   1. `char` - символьный тип. Значения - символы, например, `f`, `7`, `=`, `?`.
   2. `string` - строчный тип. Значения - какие-то строки, например, `hello`, `Ноториус Биг`, `P.S.Y`.
3. `boolean` - логический тип. Значения - `true` (истина) или `false` (ложь).
4. Прочие типы: массивы, записи, классы. Пока не будем о них говорить

### Операторы
У каждого типа данных есть свои операторы.

Оператор - это действие, которое можно совершить над одной или несколькими переменными.

Над разными объектами (переменными) возможно совершать разные действия.
Например, числа можно суммировать, вычитать, делить, умножать.

Список операторов:
1. Присвоение значения. Присвоение - это когда мы объясняем программе, что хотим положить в переменную, какое значение. 
   - Пример: `x := 10` - в переменную `x` кладём значение `10`.
2. Сложение. Складываются два значения.
   - Пример 1: Пусть переменная `x` имеет значение `10`, переменная `y` имеет значение `5`.
      Тогда `x+y` равняется `15`
   - Пример 2: Пусть переменная `s1` имеет значение `йоу`, переменная `s2` имеет значение `привет`.
      Тогда `s1+s2` равняется `йоупривет`
3. Есть другие операторы. 

### Программы

Программа, в которой:
1. Объявляется переменная `x` типа `integer`
2. `x` вводится через `readln`
3. 
```pascal
program MyProgram; 

var // объявление переменных
  x:integer; // название_переменной:тип_переменной
begin // начало программы
  readln(x); // readln = real line = считать линию
  // Считывает с линии введённую строку
  writeln('Вы ввели:', x);
end. // конец программы
```
## Задание:
Написать программу, которая должна:
1. Считать два числа в две переменных
2. Посчитать их сумму и засунуть результат в третью переменную
3. Вывести третью переменную

# Урок 3
## Условия (if) и циклы (for, while)

### Условия
Условие - это часть программы, в котором мы говорим программе:
1. Если *какое-то условие* выполнено, то сделай *действие 1*
2. Если выполнено *какое-то другое условие*, то сделай *действие 2*
3. В противном случае, сделай *действие 3*

Пример из жизни:
1. Если *ты голодный*, *сходи поешь*
2. Если *получил двойку*, *начинай плакать*
3. Иначе, *радуйся*

Общая структура: 

### Калькулятор
```pascal
program MyProgram; 

var
  a , b:real;
  operation:char;
  answer:real;
begin
  writeln('введите первое число:');
  readln(a);
  writeln('введите операцию:');
  readln(operation);
  writeln('введите второе число:');
  readln(b);
  
  if operation = '+' 
    then answer := a + b
  else if operation = '-'
    then answer := a-b
  else if operation = '/'
    then answer := a/b
  else if operation = '*'
    then answer := a*b
  else writeln('Неверный оператор! Понял???!!!');
  
  writeln('ответ:', answer);
    
end.
```
## Задание:
Написать программу, которая должна:
1. Считать два числа в две переменных
2. Посчитать их сумму и засунуть результат в третью переменную
3. Вывести третью переменную
